Example/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1014.54;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform 1014.54;
    }
    Outlet
    {
        type            zeroGradient;

    }

    Thermowell
    {
        type            omegaWallFunction;
        value           uniform 1014.54;
    }
	Symmetry
    {
        type            symmetry;
    }
}


// ************************************************************************* //